itexpertshire/esp32-timelapse/src/app_main.cpp
/*************************************************************************************************************************************************
Very loosly based on this: https://www.bitsnblobs.com/time-lapse-camera-using-the-esp32-cam

Author name: Radu Privantu
License: Apache License 2.0

*************************************************************************************************************************************************/


  /********************************************************************************************************************
 *  Board Settings:
 *  Board: "ESP32 Cam AI Thinker"
 *  Upload Speed: "921600"
 *  Flash Frequency: "80MHz"
 *  Flash Mode: "QIO"
 *  Partition Scheme: "Hue APP (3MB No OTA/1MB SPIFFS)"
 *  Core Debug Level: "None"
 *  COM Port: Depends *On Your System*
 *********************************************************************************************************************/

#include "esp_camera.h"
#include "FS.h"
#include "SPI.h"
#include "driver/i2c.h"
#include <SD.h>
#include "SD_MMC.h"
#include "driver/rtc_io.h"
#include <WiFi.h>
#include <WiFiManager.h>
#include <time.h>
#include "esp_sntp.h"
#include <ESP32_FTPClient.h>


//!!DONT FORGET TO UPDATE Secrets.h with your WIFI Credentials!!
char ftp_server[] = "192.168.1.199";
char ftp_user[]   = "amit";
char ftp_pass[]   = "amit";
const char* sdcardPhotoDir = "/Photos";
const char* ftpDir = "files";

///RTC Time Setting
const char* ntpServer = "192.168.1.199";
const long gmtOffset_sec = -28800;
const int daylightOffset_sec = 3600;

// you can pass a FTP timeout and debbug mode on the last 2 arguments
ESP32_FTPClient ftp (ftp_server,ftp_user,ftp_pass, 1000, 2); // Disable Debug to increase Tx Speed




RTC_DATA_ATTR int cur_pic = 0;


int debug = 0;
bool debugSdcard = false;

// Select camera model
//#define CAMERA_MODEL_WROVER_KIT
//#define CAMERA_MODEL_ESP_EYE
//#define CAMERA_MODEL_M5STACK_PSRAM
//#define CAMERA_MODEL_M5STACK_WIDE
#define CAMERA_MODEL_AI_THINKER

#include "camera_pins.h"



#define NIGHT_TIME_TO_SLEEP  30            //night time ESP32 will go to sleep (in seconds)
#define DAY_TIME_TO_SLEEP  900            //day time ESP32 will go to sleep (in seconds)
#define uS_TO_S_FACTOR 1000000ULL   //conversion factor for micro seconds to seconds */

#define OV2640_MAXLEVEL_SHARPNESS 6

typedef unsigned char u8;
uint16_t nextImageNumber = 0;
int max_retry_count=10;
int light=0;
int day_switch_value=45;
bool enable_ftp=true;

void listDir(fs::FS &fs, const char * dirname, uint8_t levels);
void deleteFile(fs::FS &fs, const char * path);
void start_ftp_process();
//void readAndSendBigBinFile(fs::FS& fs,const char* filename, String fullpath, ESP32_FTPClient ftpClient);
void createDir(fs::FS &fs, const char * path);
void logSDCard(const char * dataMessage);
void setupLogfile();
void appendFile(fs::FS &fs, const char * path, const char * message);
void writeFile(fs::FS &fs, const char * path, const char * message);
bool initConfigFile();
bool updateConfigFile();
void printLocalTime();
String gettime();
int change_sharpness( int sharpness );
int get_file_size(const char *fileName);


const static u8 OV2640_SHARPNESS_AUTO[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0x20, 0x20,
0x00, 0x00, 0x00
};

const static u8 OV2640_SHARPNESS_MANUAL[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0x00, 0x20,
0x00, 0x00, 0x00
};

const static u8 OV2640_SHARPNESS_LEVEL0[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xc0, 0x1f,
0x00, 0x00, 0x00
};
const static u8 OV2640_SHARPNESS_LEVEL1[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xc1, 0x1f,
0x00, 0x00, 0x00
};
const static u8 OV2640_SHARPNESS_LEVEL2[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xc2, 0x1f,
0x00, 0x00, 0x00
};
const static u8 OV2640_SHARPNESS_LEVEL3[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xc4, 0x1f,
0x00, 0x00, 0x00
};
const static u8 OV2640_SHARPNESS_LEVEL4[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xc8, 0x1f,
0x00, 0x00, 0x00
};
const static u8 OV2640_SHARPNESS_LEVEL5[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xd0, 0x1f,
0x00, 0x00, 0x00
};
const static u8 OV2640_SHARPNESS_LEVEL6[]=
{
0xFF, 0x00, 0xff,
0x92, 0x01, 0xff,
0x93, 0xdf, 0x1f,
0x00, 0x00, 0x00
};

const static u8 *OV_SETTING_SHARPNESS[]=
{
OV2640_SHARPNESS_LEVEL0,
OV2640_SHARPNESS_LEVEL1,
OV2640_SHARPNESS_LEVEL2,
OV2640_SHARPNESS_LEVEL3,
OV2640_SHARPNESS_LEVEL4,
OV2640_SHARPNESS_LEVEL5,
OV2640_SHARPNESS_LEVEL6
};

static int table_mask_write(const u8* ptab)
{
u8 address;
u8 value,orgval;
u8 mask;
const u8 *pdata=ptab;

if ( NULL==pdata )   
    return -1;

sensor_t * s = esp_camera_sensor_get();

while(1)   
{   
    address =*pdata++;   
    value = *pdata++;   
    mask = *pdata++;           
    if ( (0==address) && (0==value) &&(0==mask) )   
    {   
        break;   
    }   
    
    s->set_reg(s,address,mask,value);
}   

return 0;   

}

int change_sharpness( int sharpness )
{
if ( sharpness > OV2640_MAXLEVEL_SHARPNESS)
{
return -1;
}

if( sharpness <0 )   
{   
    table_mask_write(OV2640_SHARPNESS_AUTO);       
}   
else   
{   
    table_mask_write(OV2640_SHARPNESS_MANUAL);     
    table_mask_write(OV_SETTING_SHARPNESS[sharpness]);   
}      

return 0;   

}


String gettime(){
  struct tm timeinfo;
  

  if(!getLocalTime(&timeinfo)){
    Serial.println("Failed to obtain time");
    return "";
  }
  char currentTime[15];
  strftime(currentTime,15, "%d%m%Y%H%M%S", &timeinfo);

  Serial.println("currentTime "+String(currentTime));

  return String(currentTime);
}


void printLocalTime(){
  struct tm timeinfo;
  if(!getLocalTime(&timeinfo)){
    Serial.println("Failed to obtain time");
      Serial.print("Connecting to ");
      Serial.println("Cudy-24G");
      WiFi.begin("Cudy-24G", "81249022");
      while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print(".");
      }
      Serial.println("");
      Serial.println("WiFi connected.");
      Serial.println(WiFi.localIP());
      configTime(gmtOffset_sec, daylightOffset_sec, ntpServer,ntpServer,ntpServer);
      sntp_sync_status_t syncStatus = sntp_get_sync_status();
      if (syncStatus != SNTP_SYNC_STATUS_COMPLETED) {
          delay(5000); // Adjust the delay time as per your requirements
          syncStatus = sntp_get_sync_status();
          Serial.print("syncStatus ");
          Serial.println(syncStatus);
      }
      sntp_stop();  //resets syncStatus to SNTP_SYNC_STATUS_RESET for the next time I initiate 
    
    
  } else {
    
  Serial.println(&timeinfo, "%A, %B %d %m %Y %H:%M:%S");
  }
    //disconnect WiFi as it's no longer needed
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  btStop();
  
