itexpertshire/esp32-timelapse/src/app_main.cpp
}

// Write the sensor readings on the SD card
void logSDCard(const char * dataMessage) {
  //Serial.print("Save data: ");
  //Serial.println(dataMessage);
  if (debugSdcard) appendFile(SD_MMC, "/esplog.txt", dataMessage);
}

void setupLogfile(){
    // Create a file on the SD card and write the data labels
  File logfile = SD_MMC.open("/esplog.txt");
  if(!logfile) {
    Serial.println("File doens't exist");
    Serial.println("Creating file...");
    writeFile(SD_MMC, "/esplog.txt", "Log generated \r\n");
    debugSdcard=true;
  }
  else {
    Serial.println("File already exists");  
    debugSdcard=true;
  }
  logfile.close();
}

// Write to the SD card (DON'T MODIFY THIS FUNCTION)
void writeFile(fs::FS &fs, const char * path, const char * message) {
  Serial.printf("Writing file: %s\n", path);

  File logfile = fs.open(path, FILE_WRITE);
  if(!logfile) {
    Serial.println("Failed to open file for writing");
    return;
  }
  if(logfile.println(message)) {
    Serial.println("File written");
  } else {
    Serial.println("Write failed");
  }
  logfile.close();
}

// Append data to the SD card (DON'T MODIFY THIS FUNCTION)
void appendFile(fs::FS &fs, const char * path, const char * message) {
  //Serial.printf("Appending to file: %s\n", path);

  File logfile = fs.open(path, FILE_APPEND);
  if(!logfile) {
    Serial.println("Failed to open file for appending");
    return;
  }
  if(logfile.println(message)) {
    //Serial.println("Message appended");
  } else {
    Serial.println("Append failed");
    debugSdcard=false;
  }
  logfile.close();
}


void setup() 
{
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); //disable brownout detector
  //setCpuFrequencyMhz(240);
  //# Set to the new timezone we want & convert it
  setenv("TZ","PST8PDT",1);
  tzset();
  
  Serial.begin(115200);
  delay(1200);
  printLocalTime();
  
  
  

  #if defined(CAMERA_MODEL_AI_THINKER)
    pinMode(LED_OUT_PIN, OUTPUT);
    digitalWrite(LED_OUT_PIN, LOW);
  #endif

  

  //initialize & mount SD card
  if(!SD_MMC.begin("/sdcard",true))
  {
    Serial.println("Card Mount Failed");
    delay(10000);
    //ESP.restart();
    
  } else {
    setupLogfile();
    if (! initConfigFile()) Serial.println("Unable to initialise config file");
    createDir(SD_MMC,sdcardPhotoDir); //Create directory for saving images
  }

uint8_t cardType = SD_MMC.cardType();

  if(cardType == CARD_NONE)
  {
    Serial.println("No SD card attached");
    logSDCard("No SD card attached"); 
    return;
  }

  Serial.println();
  Serial.print("Booting... at ");
  Serial.println(millis());
  logSDCard("Booting... at ");
  logSDCard(String(millis()).c_str());

  //pinMode(4, INPUT);              //GPIO for LED flash
  //digitalWrite(4, LOW);
  //rtc_gpio_hold_dis(GPIO_NUM_4);  //diable pin hold if it was enabled before sleeping
  
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz =   10000000;
  
  config.pixel_format = PIXFORMAT_JPEG;
  
  //init with high specs to pre-allocate larger buffers
  if(psramFound())
  {
    config.frame_size = FRAMESIZE_UXGA;
    config.jpeg_quality = 16;
    config.fb_count = 2;
  } else 
  {
    config.frame_size = FRAMESIZE_SVGA;
    config.jpeg_quality = 12;
    config.fb_count = 1;
  }




  
  //initialize camera
  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) 
  {
    Serial.printf("Camera init failed with error 0x%x", err);
    logSDCard("Camera init failed with error "+err);
    delay(10000);
    
    esp_sleep_enable_timer_wakeup(NIGHT_TIME_TO_SLEEP * uS_TO_S_FACTOR);
    esp_deep_sleep_start();
    
    
  } else {
    digitalWrite(LED_OUT_PIN, HIGH);   
    delay(1200);
    
  }

camera_fb_t * fb = NULL;
sensor_t * s = esp_camera_sensor_get();


  s->set_whitebal(s, 1);       // 0 = disable , 1 = enable
  s->set_awb_gain(s, 1);       // 0 = disable , 1 = enable
  s->set_wb_mode(s, 2);        // 0 to 4 - if awb_gain enabled (0 - Auto, 1 - Sunny, 2 - Cloudy, 3 - Office, 4 - Home)
  //s->set_exposure_ctrl(s, 1);  // 0 = disable , 1 = enable
 // s->set_aec2(s, 0);           // 0 = disable , 1 = enable
  //s->set_ae_level(s, 2);       // -2 to 2
  //s->set_aec_value(s, 1200);    // 0 to 1200
  s->set_gain_ctrl(s, 0);      // 0 = disable , 1 = enable
  s->set_agc_gain(s, 0);       // 0 to 30
  s->set_gainceiling(s, (gainceiling_t)6);  // 0 to 6
  s->set_bpc(s, 1);            // 0 = disable , 1 = enable
  s->set_wpc(s, 1);            // 0 = disable , 1 = enable
  s->set_raw_gma(s, 1);        // 0 = disable , 1 = enable
  s->set_lenc(s, 0);           // 0 = disable , 1 = enable
  s->set_hmirror(s, 0);        // 0 = disable , 1 = enable
  s->set_vflip(s, 0);          // 0 = disable , 1 = enable
  s->set_dcw(s, 0);            // 0 = disable , 1 = enable
  s->set_colorbar(s, 0);       // 0 = disable , 1 = enable    
 
    
   s->set_reg(s,0xff,0xff,0x01);//banksel   
   light=s->get_reg(s,0x2f,0xff);
   Serial.print("First light is ");
   Serial.println(light);
   logSDCard("First light is ");
   logSDCard(String(light).c_str());



    if(light<day_switch_value)
    {
      //here we are in night mode
      if(light<45)s->set_reg(s,0x11,0xff,1);//frame rate (1 means longer exposure)
      s->set_reg(s,0x13,0xff,0);//manual everything
      s->set_reg(s,0x0c,0x6,0x8);//manual banding
           
      s->set_reg(s,0x45,0x3f,0x3f);//really long exposure (but it doesn't really work)

         
        if(light==0)
          {
            s->set_reg(s,0x47,0xff,0x40);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0xf0);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust
          }
          else if(light==1)
          {
            s->set_reg(s,0x47,0xff,0x40);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0xd0);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust
          }
          else if(light==2)
          {
            s->set_reg(s,0x47,0xff,0x40);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0xb0);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust  
          }
          else if(light==3)
          {
            s->set_reg(s,0x47,0xff,0x40);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x70);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust      
          }    
          else if(light==4)
          {
            s->set_reg(s,0x47,0xff,0x40);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x40);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust
          }
          else if(light==5)
          {
            s->set_reg(s,0x47,0xff,0x20);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x80);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light==6)
          {
            s->set_reg(s,0x47,0xff,0x20);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x40);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }         
          else if(light==7)
          {
            s->set_reg(s,0x47,0xff,0x20);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x30);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light==8)
          {
            s->set_reg(s,0x47,0xff,0x20);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x20);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }     
          else if(light==9)
          {
            s->set_reg(s,0x47,0xff,0x20);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x10);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }    
          else if(light==10)
          {
            s->set_reg(s,0x47,0xff,0x10);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x70);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light<=12)
          {
            s->set_reg(s,0x47,0xff,0x10);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x60);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light<=14)
          {
            s->set_reg(s,0x47,0xff,0x10);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x40);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }          
          else if(light<=18)
          {
            s->set_reg(s,0x47,0xff,0x08);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0xb0);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light<=20)
          {
            s->set_reg(s,0x47,0xff,0x08);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x80);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }      
          else if(light<=23)
          {
            s->set_reg(s,0x47,0xff,0x08);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x60);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }           
          else if(light<=27)
          {
            s->set_reg(s,0x47,0xff,0x04);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0xd0);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light<=31)
          {
            s->set_reg(s,0x47,0xff,0x04);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x80);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }     
          else if(light<=35)
          {
            s->set_reg(s,0x47,0xff,0x04);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x60);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }    
          else if(light<=40)
          {
            s->set_reg(s,0x47,0xff,0x02);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x70);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          else if(light<45)
          {
            s->set_reg(s,0x47,0xff,0x02);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0x40);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }
          //after this the frame rate is higher, so we need to compensate
          else if(light<50)
          {
            s->set_reg(s,0x47,0xff,0x04);//Frame Length Adjustment MSBs
            s->set_reg(s,0x2a,0xf0,0xa0);//line adjust MSB
            s->set_reg(s,0x2b,0xff,0xff);//line adjust        
          }  
          if(light<day_switch_value)s->set_reg(s,0x43,0xff,0x40);//magic value to give us the frame faster (bit 6 must be 1)
          change_sharpness(2); 
            
       

