itexpertshire/esp32-timelapse/src/app_main.cpp
    }
    else
    {
      esp_camera_deinit();
      //initialize camera
      esp_err_t err = esp_camera_init(&config);
      if (err != ESP_OK) 
      {
        Serial.printf(" 2nd time Camera init failed with error 0x%x", err);
        logSDCard(" 2nd time Camera init failed with error "+err);        
        delay(10000);
        esp_sleep_enable_timer_wakeup(NIGHT_TIME_TO_SLEEP * uS_TO_S_FACTOR);
        esp_deep_sleep_start();
        
        
      } else {
        digitalWrite(LED_OUT_PIN, HIGH);     
        s = esp_camera_sensor_get();
        //s->set_wb_mode(s, 0); 
      }
         
    }
 
                  
    //skipping initial 2 frames
        delay(1200);
        Serial.println("Getting first frame at");
        Serial.println(millis());    
        logSDCard("Getting first frame at ");
        logSDCard(String(millis()).c_str());
        if(fb)esp_camera_fb_return(fb);
        fb = esp_camera_fb_get();
        if(fb)esp_camera_fb_return(fb);
        fb = esp_camera_fb_get();
        Serial.println("Got first frame at");
        Serial.println(millis());   
        logSDCard("Got first frame at "); 
        logSDCard(String(millis()).c_str());
        Serial.println("Frame size "+String(fb->len));
        
        if(fb)esp_camera_fb_return(fb);

  
  

  //delay(1200); //wait before reading the frame
 
  // 1st Frame
  fb = nullptr; //clearing up memory
  
  fb = esp_camera_fb_get();
  int retries=0;
  if(!fb)
  while(1)
  {
    Serial.println("Not having image yet, waiting a bit");
    logSDCard("Not having image yet, waiting a bit"); 
    delay(500);
    fb = esp_camera_fb_get();
    if(fb)break;

    retries++;
    if(retries>max_retry_count)break;
  }
   
    if (light < day_switch_value) {
//since we got the frame buffer, we reset the sensor and put it to sleep while saving the file
    s->set_reg(s,0xff,0xff,0x01);//banksel
    s->set_reg(s,0x12,0xff,0x80);//reset (we do this to clear the sensor registries, it seems to get more consistent images this way)
    delay(1000);
    s->set_reg(s,0x09,0x10,0x10);//stand by
    delay(1000);
    }

  char path[128];
  String fullPath = sdcardPhotoDir;
  
  if(debug)sprintf(path,"/%05i_%i_%i.jpg",cur_pic,millis(),cur_pic);
  else sprintf(path,"/%05i_%i_%s.jpg",cur_pic,light,gettime().c_str());

  fullPath.concat(path);

  fs::FS &fs = SD_MMC;

  
  if(fb) {

  //create new file
  File file = fs.open(fullPath, FILE_WRITE);
  if(!file)
  {
    Serial.println("Failed to create file");
    Serial.println("Exiting now"); 
    logSDCard("Failed to create file Exiting now"); 
    //while(1);   //wait here as something is not right    
  } else {
  
  file.write(fb->buf, fb->len);  
  file.close();
  Serial.print("Saving first file as ");
  Serial.println(fullPath);
  logSDCard("Saving first file as "); 
  logSDCard(fullPath.c_str());
  Serial.print("File size is ");
  Serial.println(String(fb->len));
  logSDCard("File size is "); 
  logSDCard(String(fb->len).c_str());

  cur_pic++;
  if (! updateConfigFile()) Serial.println("Unable to update config file");
  }
  } else {

    Serial.println("Unable to get the image from camera.");
    logSDCard("Unable to get the image from camera.");

  }

  //pinMode(4, OUTPUT);              //GPIO for LED flash
  //digitalWrite(4, LOW);            //turn OFF flash LED
  //rtc_gpio_hold_en(GPIO_NUM_4);    //make sure flash is held LOW in sleep  
  


  if(enable_ftp  /*&& light>day_switch_value && (cur_pic%10) == 0*/)
    {
      //here we are in daylight mode
      //Not use for taking night sky picture, so switching off camera and switching on Wifi and transfer all photo to raspberry
      start_ftp_process();
      
      Serial.println("Entering deep sleep mode at after ftp ");
      Serial.println(millis());
      logSDCard("Entering deep sleep mode at after ftp  ");
      logSDCard(String(millis()).c_str()); 
      Serial.flush(); 
      esp_sleep_enable_timer_wakeup(NIGHT_TIME_TO_SLEEP * uS_TO_S_FACTOR);
      esp_deep_sleep_start();     
    
    } else {
        Serial.println("Entering deep sleep mode at ");
        Serial.println(millis());
        logSDCard("Entering deep sleep mode at "); 
        logSDCard(String(millis()).c_str());
        Serial.flush(); 
        esp_sleep_enable_timer_wakeup(NIGHT_TIME_TO_SLEEP * uS_TO_S_FACTOR);
        esp_deep_sleep_start();
    }
    
}

void loop() 
{


}

void start_ftp_process(){
  
  WiFi.mode(WIFI_MODE_STA);
  delay(500);
  WiFi.begin( "Cudy-24G", "81249022" );
  
  Serial.println("Connecting Wifi...");
  logSDCard("Connecting Wifi..."); 
  int retries=0;
  while (WiFi.status() != WL_CONNECTED) {
      delay(500);
      Serial.print(".");
      //logSDCard("."); 
      retries++;
      if(retries>20) ESP.restart();
  }
  Serial.println("");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
  logSDCard("IP address: "); 
  logSDCard(WiFi.localIP().toString().c_str());

  fs::FS &fs = SD_MMC;
 
  // Display Card Size
  uint64_t cardSize = SD_MMC.cardSize() / (1024 * 1024);
  Serial.printf("SD Card Size: %lluMB\n", cardSize);


  ftp.OpenConnection();

  if (ftp.isConnected()) {

    logSDCard("FTP Connection Successful!");

  // Using File Upload Types:
  // ftp.InitFile("Type A") [ASCII]    and      ftp.InitFile("Type I")    [IMAGE/BINARY]
  // If you can read the whole file in notepad, then type A can be used....
  // Other wise use Type I
  ftp.ChangeWorkDir(ftpDir);
  
  // Transfer a file from our SD Card in Binary Mode, which is too big for memory

  //Serial.printf("Listing directory: %s\n", sdcardPhotoDir);
  
  logSDCard("Listing directory: "); 
  logSDCard(sdcardPhotoDir); 

  File root = fs.open(sdcardPhotoDir);
  if(!root){
    Serial.println("Failed to open directory");
    return;
  }
  if(!root.isDirectory()){
    Serial.println("Not a directory");
    return;
  }

  File file = root.openNextFile();
  while(file){
    if(!ftp.isConnected()){
      ftp.CloseConnection();
      Serial.print(" FTP Reconnecting ");
     ftp.OpenConnection();
    }
    if(file.isDirectory()){
      Serial.print("  DIR : ");
      Serial.println(file.name());      
    } else if (String(file.name()).endsWith("jpg") ){
      Serial.print("  FILE: ");
      Serial.print(file.name());
      Serial.print("  SIZE: ");
      Serial.println(file.size());
      String fullPath = sdcardPhotoDir;
      fullPath.concat("/"+String(file.name()));
      //Serial.printf("Reading file: %s\n", fullPath);
      //readAndSendBigBinFile(SD_MMC, file.name(),fullPath, ftp);                 // 272,546  
      ftp.InitFile("Type I");
      ftp.NewFile(file.name());
      char sz = file.size();
      int fileSize = file.size();
      Serial.print("File Size:");
      Serial.println(fileSize);   
      unsigned char * downloaded_file = (unsigned char *) malloc(fileSize);    
      size_t bytesRead = file.read(downloaded_file, fileSize); // read the file contents into the array   
      //const char* myString = reinterpret_cast<const char*>(downloaded_file);  // for converting unsigned char to const char*
      ftp.WriteData(downloaded_file, fileSize);   
      free(downloaded_file);
      ftp.CloseFile();      
      file.close();   
      Serial.print("Remote file size: ");
      int siz = get_file_size(file.name());
      Serial.println("siz-"+String(siz));
      fs.rename(fullPath,fullPath+".txd");
    } else {
      logSDCard("File not valid for ftp.");
      logSDCard(String(file.name()).c_str()); 
    }
    
     file = root.openNextFile();
  }

if(ftp.isConnected()){
  //transfer log file also
  File logfile = fs.open("/esplog.txt");
  //readAndSendBigBinFile(SD_MMC, logfile.name(),"/esplog.txt", ftp);
  ftp.InitFile("Type I");
  ftp.NewFile(logfile.name());
  char sz = logfile.size();
  int fileSize = logfile.size();
  Serial.print("File Size:");
  Serial.println(fileSize);   
  unsigned char * downloaded_file = (unsigned char *) malloc(fileSize);    
  size_t bytesRead = logfile.read(downloaded_file, fileSize); // read the file contents into the array   
  //const char* myString = reinterpret_cast<const char*>(downloaded_file);  // for converting unsigned char to const char*
  ftp.WriteData(downloaded_file, fileSize);   
  free(downloaded_file);
  ftp.CloseFile();
  logfile.close(); 
  ftp.CloseConnection();
}

  } else {
          Serial.println("FTP Connection Failure!");
          logSDCard("FTP Connection Failure!");
         }

 
