itexpertshire/esp32-timelapse/src/app_main.cpp
}

//Get the filesize

int get_file_size(const char *fileName){
  // Get the file size
	//const char *fileName = "myPhoto.png";
	size_t fileSize      = 0;
	String list[128];
  char *result=const_cast<char*>("0");
  
	// Get the directory content in order to allocate buffer
	// my server response is type=file;size=18;modify=20190731140703;unix.mode=0644;unix.uid=10183013;unix.gid=10183013;unique=809g7c8e92e4; helloworld.txt
	//ftp.InitFile("Type A");
	ftp.GetSize(fileName, result);
  Serial.println(result);
	
  return fileSize;
}


// ReadFile Example from ESP32 SD_MMC Library within Core\Libraries
// Changed to also write the output to an FTP Stream
/*
void readAndSendBigBinFile(fs::FS& fs,const char* filename, String fullpath, ESP32_FTPClient ftpClient) {
    ftpClient.InitFile("Type I");
    ftpClient.NewFile(filename);
    
    

    File file = fs.open(fullpath);
    if (!file) {
        Serial.println("Failed to open file for reading");
        return;
    }

    Serial.println("Read from file: "+fullpath);

    logSDCard("Read from file: "); 
    logSDCard(fullpath.c_str());

    while (file.available()) {
        // Create and fill a buffer
        unsigned char buf[512];
        int readVal = file.read(buf, sizeof(buf));
        ftpClient.WriteData(buf,sizeof(buf));
    }
    ftpClient.CloseFile();
    file.close();
    if(ftp.isConnected()){
    //ftp.OpenConnection();
    fs.rename(fullpath,fullpath+".txd"); //rename the file which were successfully transferred
     }
    
    
}
*/

void createDir(fs::FS &fs, const char * path){
  Serial.printf("Creating Dir: %s\n", path);
  if(fs.mkdir(path)){
    Serial.println("Dir created");
  } else {
    Serial.println("mkdir failed");
  }
}

void deleteFile(fs::FS &fs, const char * path){
  Serial.printf("Deleting file: %s\n", path);
  if(fs.remove(path)){
    Serial.println("File deleted");
  } else {
    Serial.println("Delete failed");
  }
}


void listDir(fs::FS &fs, const char * dirname, uint8_t levels){
  Serial.printf("Listing directory: %s\n", dirname);

  File root = fs.open(dirname);
  if(!root){
    Serial.println("Failed to open directory");
    return;
  }
  if(!root.isDirectory()){
    Serial.println("Not a directory");
    return;
  }

  File file = root.openNextFile();
  while(file){
    if(file.isDirectory()){
      Serial.print("  DIR : ");
      Serial.println(file.name());
      if(levels){
        listDir(fs, file.name(), levels -1);
      }
    } else {
      Serial.print("  FILE: ");
      Serial.print(file.name());
      Serial.print("  SIZE: ");
      Serial.println(file.size());
    }
     file = root.openNextFile();
  }
}

bool initConfigFile(){
   File myFile;
   if (!SD_MMC.exists("/timelapse.cfg")) {
    Serial.println(F("/timelapse.cfg doesn't exist. Creating /timelapse.cfg file..."));
    // create a new file by opening a new file and immediately close it
    myFile = SD_MMC.open("/timelapse.cfg", FILE_WRITE);
    if (myFile) {
                  myFile.println("filecnt:"+String(cur_pic));
                  myFile.close();
                } else {
                  Serial.print(F("SD Card: Issue encountered while attempting to open the file timelapse.cfg"));
                  return false;
                }
   
  } else {
    myFile = SD_MMC.open("/timelapse.cfg", FILE_READ);
    Serial.println(F("Reading timelapse.cfg ..."));
     if (myFile) {
                    while (myFile.available()) {
                              String line = myFile.readStringUntil('\n');
                              Serial.println(line);
                              //if line contains config parameter, then use to initialise filecnt, else initialise with 1
                              if(line.startsWith("filecnt")){
                                //get last filecnt value
                                line.replace("filecnt:","");
                                cur_pic = line.toInt();
                              }
                    }
                    myFile.close();
                 } else {
                    Serial.print(F("SD Card: Issue encountered while attempting to open the file /timelapse.cfg"));
                    return false;
                    }

  }

  return true;

}

bool updateConfigFile(){
   File myFile;
   if (!SD_MMC.exists("/timelapse.cfg")) {
    Serial.println(F("/timelapse.cfg doesn't exist. Can't update timelapse.cfg file..."));
    return false;
   
  } else {
    myFile = SD_MMC.open("/timelapse.cfg", FILE_WRITE);

     if (myFile) {
                  myFile.seek(0);
                  myFile.println("filecnt:"+String(cur_pic));
                  myFile.close();
                 } 
    else {
                 Serial.print(F("SD Card: Issue encountered while attempting to open the file /timelapse.cfg"));
                 return false;
          }

  }

  return true;

}